In [2]:
import pandas as pd
import numpy as np

In [4]:
lst = ['Geeks','For','Geeks','is','portal','for','Geeks']
df = pd.DataFrame(lst)
df

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [5]:
data = {'Name':['ram','shyam','princi','sita'],
        'Age':[20,21,19,18]
}
df = pd.DataFrame(data)
df

     Name  Age
0     ram   20
1   shyam   21
2  princi   19
3    sita   18

In [7]:
data = {'Name':['ram','shyam','princi','sita'],
        'Age':[20,21,19,18],
        'Address':['Delhi','Kanpur','Allabad','Janakpur'],
        'Qualification':['MEng','Msc','MCom','Phd']
}
df = pd.DataFrame(data)
print(df)
print(df[['Name','Address']])

     Name  Age   Address Qualification
0     ram   20     Delhi          MEng
1   shyam   21    Kanpur           Msc
2  princi   19   Allabad          MCom
3    sita   18  Janakpur           Phd
     Name   Address
0     ram     Delhi
1   shyam    Kanpur
2  princi   Allabad
3    sita  Janakpur

In [21]:
df = pd.DataFrame(data,index=data['Age'])
df

      Name  Age   Address Qualification
20     ram   20     Delhi          MEng
21   shyam   21    Kanpur           Msc
19  princi   19   Allabad          MCom
18    sita   18  Janakpur           Phd

In [27]:
print(df.loc[20])
print()
print(df.iloc[3])

Name               ram
Age                 20
Address          Delhi
Qualification     MEng
Name: 20, dtype: object

Name                 sita
Age                    18
Address          Janakpur
Qualification         Phd
Name: 18, dtype: object

In [38]:
dict1 = {'First':[100,90,np.nan,95],
'Second':[45,np.nan,30,20],
'Third':[10,20,30,40]}
df=pd.DataFrame(dict1)
df.isnull()

   First  Second  Third
0  False   False  False
1  False    True  False
2   True   False  False
3  False   False  False

In [32]:
df.fillna(0)

   First  Second  Third
0  100.0    45.0     10
1   90.0     0.0     20
2    0.0    30.0     30
3   95.0    20.0     40

In [36]:
df.interpolate(method='cubicspline')

        First     Second  Third
0  100.000000  45.000000     10
1   90.000000  38.333333     20
2   88.333333  30.000000     30
3   95.000000  20.000000     40

In [41]:
df.replace(np.nan,0)

   First  Second  Third
0  100.0    45.0     10
1   90.0     0.0     20
2    0.0    30.0     30
3   95.0    20.0     40

In [42]:
for i,j in df.iterrows():
    print(i)
    print()
    print(j)

0

First     100.0
Second     45.0
Third      10.0
Name: 0, dtype: float64
1

First     90.0
Second     NaN
Third     20.0
Name: 1, dtype: float64
2

First      NaN
Second    30.0
Third     30.0
Name: 2, dtype: float64
3

First     95.0
Second    20.0
Third     40.0
Name: 3, dtype: float64

In [57]:
columns = list(df)
for i in columns:
    print(df[i][0])
print(columns)

100.0
45.0
10
['First', 'Second', 'Third']

DATA CLEANING